[Flags]
types_iscustom=Instructs Setup that the type is a custom type. Whenever the end\nuser manually changes the components selection during installation,\nSetup will set the setup type to the custom type. Note that\nif you don't define a custom type, Setup will only allow the user to\nchoose a setup type and he/she can no longer manually select/unselect\ncomponents.\n\nOnly one type may include this flag.
components_checkablealone=Specifies that the component can be checked when none of its\nchildren are. By default, if no Components parameter directly\nreferences the component, unchecking all of the component's\nchildren will cause the component to become unchecked.
components_dontinheritcheck=Specifies that the component should not automatically become\nchecked when its parent is checked. Has no effect on top-level\ncomponents, and cannot be combined with the exclusive flag.
components_exclusive=Instructs Setup that this component is mutually exclusive with\nsibling components that also have the exclusive flag.
components_fixed=Instructs Setup that this component can not be manually selected\nor unselected by the end user during installation.
components_restart=Instructs Setup to ask the user to restart the system if this\ncomponent is installed, regardless of whether this is necessary\n(for example because of [Files] section entries with the restartreplace\nflag). Like AlwaysRestart but per component.
components_disablenouninstallwarning=Instructs Setup not to warn the user that this component will\nnot be uninstalled after he/she deselected this component when\nit's already installed on his/her machine.\n\nDepending on the complexity of your components, you can try to\nuse the [InstallDelete] section and this flag to automatically\n'uninstall' deselected components.
tasks_checkablealone=Specifies that the task can be checked when none of its\nchildren are. By default, if no Tasks parameter directly\nreferences the task, unchecking all of the task's children\nwill cause the task to become unchecked.
tasks_checkedonce=Instructs Setup that this task should be unchecked initially\nwhen Setup finds a previous version of the same application\nis already installed.\n\nIf the UsePreviousTasks [Setup] section directive is no, this\nflag is effectively disabled.
tasks_dontinheritcheck=Specifies that the task should not automatically become checked\nwhen its parent is checked. Has no effect on top-level tasks,\nand cannot be combined with the exclusive flag.
tasks_exclusive=Instructs Setup that this task is mutually exclusive with sibling\ntasks that also have the exclusive flag.
tasks_restart=Instructs Setup to ask the user to restart the system at the end\nof installation if this task is selected, regardless of whether it\nis necessary (for example because of [Files] section entries with\nthe restartreplace flag). Like AlwaysRestart but per task.
tasks_unchecked=Instructs Setup that this task should be unchecked initially.
dirs_deleteafterinstall=Instructs Setup to create the directory as usual, but then delete\nit once the installation is completed (or aborted) if it's empty.\nThis can be useful when extracting temporary data needed by a \nprogram executed in the script's [Run] section.\n\nThis flag will not cause directories that already existed before\ninstallation to be deleted.
dirs_setntfscompression=Instructs Setup to enable NTFS compression on the directory. If\nit fails to set the compression state for any reason (for example,\nif compression is not supported by the file system), no error \nmessage will be displayed.\n\nIf the directory already exists, the compression state of any\nfiles present in the directory will not be changed.
dirs_uninsalwaysuninstall=Instructs the uninstaller to always attempt to delete the\ndirectory if it's empty. Normally the uninstaller will only\ntry to delete the directory if it didn't already exist prior\nto installation.
dirs_uninsneveruninstall=Instructs the uninstaller to not attempt to delete the directory.\nBy default, the uninstaller deletes any directory specified in \nthe [Dirs] section if it is empty.
dirs_unsetntfscompression=Instructs Setup to disable NTFS compression on the directory. If\nit fails to set the compression state for any reason (for example,\nif compression is not supported by the file system), no error\nmessage will be displayed.\n\nIf the directory already exists, the compression state of any\nfiles present in the directory will not be changed.
files_32bit=Causes the {sys} constant to map to the 32-bit System directory\nwhen used in the Source and DestDir parameters, the regserver and\nregtypelib flags to treat the file as 32-bit, and the sharedfile\nflag to update the 32-bit SharedDLLs registry key. This is the\ndefault behavior in a 32-bit mode install.
files_64bit=Causes the {sys} constant to map to the 64-bit System directory\nwhen used in the Source and DestDir parameters, the regserver and\nregtypelib flags to treat the file as 64-bit, and the sharedfile\nflag to update the 64-bit SharedDLLs registry key. This is the\ndefault behavior in a 64-bit mode install.
files_allowunsafefiles=Disables the compiler's automatic checking for unsafe files. It\nis strongly recommended that you DO NOT use this flag, unless you\n are absolutely sure you know what you're doing.
files_comparetimestamp=(Not recommended; see below)\nInstructs Setup to proceed to comparing time stamps if the file\nbeing installed already exists on the user's system, and at least\none of the following conditions is true:\n\n•Neither the existing file nor the file being installed has\nversion info.\n•The ignoreversion flag is also used on the entry.\n•The replacesameversion flag isn't used, and the existing file\nand the file being installed have the same version number (as\ndetermined by the files' version info).\n\nIf the existing file has an older time stamp than the file being\ninstalled, the existing file will replaced. Otherwise, it will\nnot be replaced.\n\nUse of this flag is not recommended except as a last resort,\nbecause there is an inherent issue with it: NTFS partitions\nstore time stamps in UTC (unlike FAT partitions), which causes\nlocal time stamps -- what Inno Setup works with by default --\nto shift whenever a user changes their system's time zone or\nwhen daylight saving time goes into or out of effect. This can\ncreate a situation where files are replaced when the user doesn't\nexpect them to be, or not replaced when the user expects them to be.
files_confirmoverwrite=Always ask the user to confirm before replacing an existing file.
files_createallsubdirs=By default the compiler skips empty directories when it recurses\nsubdirectories searching for the Source filename/wildcard. This\nflag causes these directories to be created at install time (just\nlike if you created [Dirs] entries for them).\n\nMust be combined\nwith recursesubdirs.
files_deleteafterinstall=Instructs Setup to install the file as usual, but then delete it\nonce the installation is completed (or aborted). This can be useful\nfor extracting temporary data needed by a program executed in the\nscript's [Run] section.\n\nThis flag will not cause existing files that weren't replaced during\ninstallation to be deleted.\n\nThis flag cannot be combined with the isreadme, regserver, regtypelib,\nrestartreplace, sharedfile, or uninsneveruninstall flags.
files_dontcopy=Don't copy the file to the user's system during the normal file\ncopying stage but do statically compile the file into the\ninstallation. This flag is useful if the file is handled by the\n[Code] section exclusively and extracted using ExtractTemporaryFile.
files_dontverifychecksum=Prevents Setup from verifying the file checksum after extraction.\nUsethis flag on files you wish to modify while already compiled\ninto Setup.\n\nMust be combined with nocompression.
files_external=This flag instructs Inno Setup not to statically compile the file\nspecified by the Source parameter into the installation files, but\ninstead copy from an existing file on the distribution media or the\nuser's system. See the Source parameter description for more\ninformation.
files_fontisnttruetype=Specify this flag if the entry is installing a non-TrueType font with\nthe FontInstall parameter.
files_gacinstall=Install the file into the .NET Global Assembly Cache. When used in\ncombination with sharedfile, the file will only be uninstalled when\nthe reference count reaches zero.\n\nTo uninstall the file Uninstaller uses the strong assembly name\nspecified by parameter StrongAssemblyName.\n\nAn exception will be raised if an attempt is made to use this flag\non a system with no .NET Framework present.
files_ignoreversion=Don't compare version info at all; replace existing files\nregardlessof their version number.\n\nThis flag should only be used on files private to your\napplication, never on shared system files.
files_isreadme=File is the "README" file. Only one file in an installation can\nhave this flag. When a file has this flag, the user will asked if\nhe/she would like to view the README file after the installation has\ncompleted.\n\nIf Yes is chosen, Setup will open the file, using the default program\nfor the file type. For this reason, the README file should always end\nwith an extension like .txt, .wri, or .doc.\n\nNote that if Setup has to restart the user's computer (as a result of\ninstalling a file with the flag restartreplace or if the AlwaysRestart\n[Setup] section directive is yes), the user will not be given an option\nto view the README file.
files_nocompression=Prevents the compiler from attempting to compress the file. Use\nthis flag on file types that you know can't benefit from compression\n(for example, JPEG images) to speed up the compilation process and save\na few bytes in the resulting installation.
files_noencryption=Prevents the file from being stored encrypted. Use this flag if\nyouhave enabled encryption (using the [Setup] section directive\nEncryption) but want to be able to extract the file using the [Code]\nsection support function ExtractTemporaryFile before the user has\nentered the correct password.
files_noregerror=When combined with either the regserver or regtypelib flags, Setup\nwill not display any error message if the registration fails.
files_onlyifdestfileexists=Only install the file if a file of the same name already exists on\nthe user's system. This flag may be useful if your installation is a\npatch to an existing installation, and you don't want files to be\ninstalled that the user didn't already have.
files_onlyifdoesntexist=Only install the file if it doesn't already exist on the user's system.
files_overwritereadonly=Always overwrite a read-only file. Without this flag, Setup will\nask the user if an existing read-only file should be overwritten.
files_promptifolder=By default, when a file being installed has an older version\nnumber (or older time stamp, when the comparetimestamp flag is\nused) than an existing file, Setup will not replace the existing\nfile. When this flag is used, Setup will ask the user whether the\nfile should be replaced, with the default answer being to keep\nthe existing file.
files_recursesubdirs=Instructs the compiler or Setup to also search for the Source\nfilename/wildcard in subdirectories under the Source directory.
files_regserver=Register the DLL/OCX file. With this flag set, Setup will call\nthe DllRegisterServer function exported by the DLL/OCX file, and\nthe uninstaller will call DllUnregisterServer prior to removing the\nfile. When used in combination with sharedfile, the DLL/OCX file\nwill only be unregistered when the reference count reaches zero.\n\nOn a 64-bit mode install, the file is assumed to be a 64-bit image\nand will be registered inside a 64-bit process. You can override\nthis by specifying the 32bit flag.
files_regtypelib=Register the type library (.tlb). The uninstaller will unregister\nthetype library (unless the flag uninsneveruninstall is specified).\nAs with the regserver flag, when used in combination with sharedfile,\nthe file will only be unregistered by the uninstaller when the\nreference count reaches zero.\n\nOn a 64-bit mode install running on an x64 edition of Windows, the\ntype library will be registered inside a 64-bit process. You can\noverride this by specifying the 32bit flag.\n\nRegistering type libraries in 64-bit mode on Itanium editions of\nWindows is not supported.
files_replacesameversion=When this flag is used and the file already exists on the user's\nsystem and it has the same version number as the file being installed,\nSetup will compare the files and replace the existing file if their\ncontents differ.\n\nThe default behavior (i.e. when this flag isn't used) is to not replace\nanexisting file with the same version number.
files_restartreplace=When an existing file needs to be replaced, and it is in use (locked)\nby another running process, Setup will by default display an error\nmessage. This flag tells Setup to instead register the file to be \nreplaced the next time the system is restarted (by calling MoveFileEx\nor by creating an entry in WININIT.INI). When this happens, the user\nwill be prompted to restart their computer at the end of the installation\nprocess.\n\nTo maintain compatibility with Windows 95/98/Me, long filenames should\nnot be used on entries with this flag. Only "8.3" filenames are supported.\n(Windows NT\nplatforms do not have this limitation.)\n\nNOTE: This flag has no effect on Windows NT platforms if the user does\nnot have administrative privileges. Therefore, when using this flag, it\nis recommended that you leave the PrivilegesRequired [Setup] section\ndirective at the default setting of admin.
files_setntfscompression=Instructs Setup to enable NTFS compression on the file (even if it\ndidn't replacethe file). If it fails to set the compression state\nfor any reason (for example, if compression is not supported by the\nfile system), no error message will be displayed.
files_sharedfile=Specifies that the file is shared among multiple applications,\nand should only be removed at uninstall time if no other applications\nare using it. Most files installed to the Windows System directory\nshould use this flag, including .OCX, .BPL, and .DPL files.\n\nWindows' standard shared file reference-counting mechanism (located\nin the registry under\nHKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\SharedDLLs)\nis used to keep track of how many applications depend on the file.\nEach time the file is installed, the reference count for the file is\nincremented. (This happens regardless of whether the installer actually\nreplaces the file on disk.) When an application using the file is\nuninstalled, the reference count is decremented. If the count reaches\nzero, the file is deleted (with the user's confirmation, unless the\nuninsnosharedfileprompt flag is also specified).\n\nIf Setup is run more than once, the reference count for the file will\nbe incremented more than once. The uninstaller will decrement the reference\ncount the same number of times, however, so no references are leaked\n(provided the UninstallLogMode [Setup] section directive isn't changed\nfrom its default setting of append).\n\nWhen this flag is used, do not specify {syswow64} in the DestDir parameter;\nuse {sys} instead. Even though {sys} and {syswow64} map to the same unde\nlying directory in a 32-bit mode install, the path name must exactly match\nwhat every other existing installer is using; otherwise, a second reference\ncount for the file would be created, which could result in the file being\nremoved prematurely. If you need to install a shared file to the 32-bit System\ndirectory in a 64-bit mode install, specify {sys} in the DestDir parameter\nand additionally include the 32bit flag.
files_skipifsourcedoesntexist=This flag instructs the compiler -- or Setup, if the external flag\nis also used -- to silently skip over the entry if the source file\ndoes not exist, instead of displaying an error message.
files_solidbreak=When solid compression is enabled, this flag instructs the compiler\nto finalize the current compression stream and begin a new one\nbefore compressing the file(s) matched by Source. This allows Setup\nto seek to the file instantly without having to decompress any preceding\nfiles first. May be useful in a large, multi-component installation\nif you find too much time is being spent decompressing files belonging\nto components that weren't selected.
files_sortfilesbyextension=This flag instructs the compiler to compress the found files sorted\nby extension befores it sorts by path name. This potentially decreases\nthe size of Setup if solid compression is also used.
files_sortfilesbyname=This flag instructs the compiler to compress the found files sorted\nby name befores it sorts by path name. This potentially decreases\nthe size of Setup if solid compression is also used. If\nsortfilesbyextension is also used, files are first sorted by extension.
files_touch=This flag causes Setup to set the time/date stamp of the installed\nfile(s) to that which is specified by the TouchDate and TouchTime\n[Setup] section directives.\n\nThis flag has no effect if combined with the external flag.
files_uninsnosharedfileprompt=When uninstalling the shared file, automatically remove the file\nif its reference count reaches zero instead of asking the user.\nMust be combined with the sharedfile flag to have an effect.
files_uninsremovereadonly=When uninstalling the file, remove any read-only attribute from\nthe file before attempting to delete it.
files_uninsrestartdelete=When this flag is used and the file is in use at uninstall time,\nthe uninstaller will queue the file to be deleted when the system\nis restarted, and at the end of the uninstallation process ask the\nuser if he/she wants to restart. This flag can be useful when\nuninstalling things like shell extensions which cannot be\nprogrammatically stopped. Note that administrative privileges are\nrequired on Windows NT platforms for this flag to have an effect.
files_uninsneveruninstall=Never remove the file. This flag can be useful when installing very\ncommon shared files that shouldn't be deleted under any circumstances,\nsuch as MFC DLLs.\n\nNote that if this flag is combined with the sharedfile flag, the file\nwill never be deleted at uninstall time but the reference count will\nstill be properly decremented.
files_unsetntfscompression=Instructs Setup to disable NTFS compression on the file (even if it\ndidn't replace the file). If it fails to set the compression state\nfor any reason (for example, if compression is not supported by the\nfile system), no error message will be displayed.
icons_closeonexit=When this flag is set, Setup will set the "Close on Exit" property\nof the shortcut. This flag only has an effect if the shortcut points\nto an MS-DOS application (if it has a .pif extension, to be specific).\nIf neither this flag nor the dontcloseonexit flags are specified,\nSetup will not attempt to change the "Close on Exit" property.
icons_createonlyiffileexists=When this flag is set, the installer will only try to create the\nicon if the file specified by the Filename parameter exists.
icons_dontcloseonexit=Same as closeonexit, except it causes Setup to uncheck the\n"Close on Exit" property.
icons_excludefromshowinnewinstall=Prevents a Start menu entry for a newly installed application\nshortcut from receiving a highlight on Windows 7 (or later).\nIgnored on earlier Windows versions.
icons_foldershortcut=Creates a special type of shortcut known as a "Folder Shortcut".\nNormally, when a shortcut to a folder is present on the Start Menu,\nclicking the item causes a separate Explorer window to open showing\nthe target folder's contents. In contrast, a "folder shortcut" will\nshow the contents of the target folder as a submenu instead of\nopening a separate window.\n\nFolder shortcuts are only supported by Windows 2000, Me, and later.\nOn earlier versions of Windows, Setup will fall back to creating a\nnormal shortcut when this flag is used.\n\nThis flag is currently ignored when running on Windows 7 (or later),\nas folder shortcuts do not expand properly on the Start Menu anymore.\nIt is not known whether this is a bug in Windows 7 or a removed feature.\n\nWhen this flag is used, a folder name must be specified in the Filename\nparameter. Specifying the name of a file will result in a non-working shortcut.
icons_runmaximized=When this flag is set, Setup sets the "Run" setting of the\nicon to "Maximized" so that the program will be initially\nmaximized when it is started.
icons_runminimized=When this flag is set, Setup sets the "Run" setting of the\nicon to "Minimized" so that the program will be initially\nminimized when it is started.
icons_uninsneveruninstall=Instructs the uninstaller not to delete the icon.
icons_useapppaths=When this flag is set, specify just a filename (no path) in the\nFilename parameter, and Setup will retrieve the pathname from the\n"HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\App\nPaths" registry key and prepend it to the filename automatically.
ini_createkeyifdoesntexist=Assign to the key only if the key doesn't already exist in the\nfile. If this flag is not specified, the key will be set regardless\nof whether it already existed.
ini_uninsdeleteentry=Delete the entry when the program is uninstalled. This can be \ncombined with the uninsdeletesectionifempty flag.
ini_uninsdeletesection=When the program is uninstalled, delete the entire section in\nwhich the entry is located. It obviously wouldn't be a good\nidea to use this on a section that is used by Windows itself\n(like some of the sections in WIN.INI). You should only use this\non sections private to your application.
ini_uninsdeletesectionifempty=Same as uninsdeletesection, but deletes the section only if\nthere are no keys left in it. This can be combined with the\nuninsdeleteentry flag.
registry_createvalueifdoesntexist=When this flag is specified, Setup will create the value only if\na value of the same name doesn't already exist. This flag has no\neffect if the data type is none, or if you specify the deletevalue\nflag.
registry_deletekey=When this flag is specified, Setup will first try deleting the\nentire key if it exists, including all values and subkeys in it.\nIf ValueType is not none, it will then create a new key and value.\n\nTo prevent disasters, this flag is ignored during installation if\nSubkey is blank or contains only backslashes.
registry_deletevalue=When this flag is specified, Setup will first try deleting the\nvalue if it exists. If ValueType is not none, it will then create\nthe key if it didn't already exist, and the new value.
registry_dontcreatekey=When this flag is specified, Setup will not attempt to create\nthe key or any value if the key did not already exist on the\nuser's system. No error message is displayed if the key does\nnot exist.\nTypically this flag is used in combination with the uninsdeletekey\nflag, for deleting keys during uninstallation but not creating them\nduring installation.
registry_noerror=Don't display an error message if Setup fails to create the key\nor value for any reason.
registry_preservestringtype=This is only applicable when the ValueType parameter is string\nor expandsz. When this flag is specified and the value did not\nalready exist or the existing value isn't a string type (REG_SZ\nor REG_EXPAND_SZ), it will be created with the type specified by\nValueType. If the value did exist and is a string type, it will\nbe replaced with the same value type as the pre-existing value.
registry_uninsclearvalue=When the program is uninstalled, set the value's data to a null\nstring (type REG_SZ). This flag cannot be combined with the\nuninsdeletekey flag.
registry_uninsdeletekey=When the program is uninstalled, delete the entire key, including\nall values and subkeys in it. It obviously wouldn't be a good idea\nto use this on a key that is used by Windows itself. You should\nonly use this on keys private to your application.\n\nTo prevent disasters, this flag is ignored during installation if\nSubkey is blank or contains only backslashes.
registry_uninsdeletekeyifempty=When the program is uninstalled, delete the key if it has no\nvalues or subkeys left in it. This flag can be combined with\nuninsdeletevalue.\n\nTo prevent disasters, this flag is ignored during installation\nif Subkey is blank or contains only backslashes.
registry_uninsdeletevalue=Delete the value when the program is uninstalled. This flag can\nbe combined with uninsdeletekeyifempty.\n\nNOTE: In Inno Setup versions prior to 1.1, you could use this flag\nalong with the data type none and it would function as a "delete\nkey if empty" flag. This technique is no longer supported. You must\nnow use the uninsdeletekeyifempty flag to accomplish this.
run_32bit=Causes the {sys} constant to map to the 32-bit System directory\nwhen used in the Filename and WorkingDir parameters. This is the\ndefault behavior in a 32-bit mode install.\n\nThis flag cannot be combined with the shellexec flag.
run_64bit=Causes the {sys} constant to map to the 64-bit System directory\nwhen used in the Filename and WorkingDir parameters. This is the\ndefault behavior in a 64-bit mode install.\n\nThis flag can only be used when Setup is running on 64-bit Windows,\notherwise an error will occur. On an installation supporting both\n32- and 64-bit architectures, it is possible to avoid the error by\nadding a Check: IsWin64 parameter, which will cause the entry to be\nsilently skipped when running on 32-bit Windows.\n\nThis flag cannot be combined with the shellexec flag.
run_hidewizard=If this flag is specified, the wizard will be hidden while the\nprogram is running.
run_nowait=If this flag is specified, it will not wait for the process to\nfinish executing before proceeding to the next [Run] entry, or\ncompleting Setup.\n\nCannot be combined with waituntilidle or waituntilterminated.
run_postinstall=Valid only in a [Run] section. Instructs Setup to create a checkbox\non the Setup Completed wizard page. The user can uncheck or check\nthis checkbox and thereby choose whether this entry should be\nprocessed or not. Previously this flag was called showcheckbox.\n\nIf Setup has to restart the user's computer (as a result of installing\na file with the flag restartreplace or if the AlwaysRestart [Setup]\nsection directive is yes), there will not be an opportunity for the\ncheckbox to be displayed and therefore the entry will never be\nprocessed.\n\nThe isreadme flag for entries in the [Files] section is now obsolete.\nIf the compiler detects a entry with an isreadme flag, it strips\nthe isreadme flag from the [Files] entry and inserts a generated [Run]\nentry at the head of the list of [Run] entries. This generated [Run]\nentry runs the README file and has flags shellexec, skipifdoesntexist,\npostinstall and skipifsilent.
run_runascurrentuser=If this flag is specified, the spawned process will inherit Setup/\nUninstall's user credentials (typically, full administrative\nprivileges).\n\nThis is the default behavior when the postinstall flag is not used.\n\nThis flag cannot be combined with the runasoriginaluser flag.
run_runasoriginaluser=Valid only in a [Run] section. If this flag is specified and the\nsystem is running Windows Vista or later, the spawned process\nwill execute with the (normally non-elevated) credentials of the\nuser that started Setup initially (i.e., the "pre-UAC dialog"\ncredentials).\n\nThis is the default behavior when the postinstall flag is used.\n\nIf a user launches Setup by right-clicking its EXE file and\nselecting "Run as administrator", then this flag, unfortunately,\nwill have no effect, because Setup has no opportunity to run any\ncode with the original user credentials. The same is true if\nSetup is launched from an already-elevated process. Note, however,\nthat this is not an Inno Setup-specific limitation; Windows\nInstaller-based installers cannot return to the original user\ncredentials either in such cases.\n\nThis flag cannot be combined with the runascurrentuser flag.
run_runhidden=If this flag is specified, it will launch the program in a hidden\nwindow. Never use this flag when executing a program that may\nprompt for user input.
run_runmaximized=If this flag is specified, it will launch the program or document\nin a maximized window.
run_runminimized=If this flag is specified, it will launch the program or document\nin a minimized window.
run_shellexec=This flag is required if Filename is not a directly executable\nfile (an .exe or .com file). When this flag is set, Filename can\nbe a folder or any registered file type -- including .chm, .doc,\nand so on. The file will be opened with the application associated\nwith the file type on the user's system, the same way it would be\nif the user double-clicked the file in Explorer.\n\nBy default, when the shellexec flag is used it will not wait until\nthe spawned process terminates. If you need that, you must add the\nflag waituntilterminated. Note that it cannot and will not wait if\na new process isn't spawned -- for example, if Filename specifies a\nfolder.
run_skipifdoesntexist=If this flag is specified in the [Run] section, Setup won't display\nan error message if Filename doesn't exist.\n\nIf this flag is specified in the [UninstallRun] section, the\nuninstaller won't display the "some elements could not be removed"\nwarning if Filename doesn't exist.\n\nWhen this flag is used, Filename must be an absolute path.
run_skipifnotsilent=Valid only in a [Run] section. Instructs Setup to skip this entry\nif Setup is not running (very) silent.
run_skipifsilent=Valid only in a [Run] section. Instructs Setup to skip this entry\nif Setup is running (very) silent.
run_unchecked=Valid only in a [Run] section. Instructs Setup to initially uncheck\nthe checkbox. The user can still check the checkbox if he/she wishes\nto process the entry. This flag is ignored if the postinstall flag\nisn't also specified.
run_waituntilidle=If this flag is specified, it will wait until the process is waiting\nfor user input with no input pending, instead of waiting for the\nprocess to terminate. (This calls the WaitForInputIdle Win32 function.)\nCannot be combined with nowait or waituntilterminated.
run_waituntilterminated=If this flag is specified, it will wait until the process has completely\nterminated. Note that this is the default behavior (i.e. you don't need\nto specify this flag) unless you're using shellexec flag, in which case\nyou do need to specify this flag if you want it to wait. Cannot be\ncombined with nowait or waituntilidle.
3rdparty_runminimized=If this flag is specified, it will launch the program or document\nin a minimized window.
3rdparty_abortonerror=If this flag is specified, the compiler will abort if an error\noccures.
3rdparty_cmdprompt=If this flag is specified, the entry will be ran in a Windows\nCommand Prompt.
3rdparty_redirectoutput=All command prompt output will be re-directed to the Compiler Output listbox.\n\nWARNING! This may slow your script down, only use when required.

[Directives]
AllowCancelDuringInstall=Setting this to no prevents the user from cancelling during the\nactual installation process, by disabling the Cancel button and\nignoring clicks on the close button. This has the same effect as\npassing /NOCANCEL to Setup on the command line.
AllowNoIcons=This is used to determine whether Setup should display a Don't\ncreate any icons check box, which allows the user to skip creation\nof program icons. If it is no the check box will not be displayed;\nif it is yes it will be displayed.
AllowRootDirectory=When set to no, the default, the user will not be allowed to\nenter a root directory (such as "C:\") on the Select Destination\nLocation page of the wizard.
AllowUNCPath=If set to no, the user will not be allowed to enter a UNC path\n(such as "\\server\share") on the Select Destination Location page\nof the wizard.\n\nThis was the default behavior in Inno Setup 2.0.17 and earlier.
AlwaysRestart=When set to yes, Setup will always prompt the user to restart\nthe system at the end of a successful installation, regardless\nof whether this is necessary (for example, because of [Files]\nsection entries with the restartreplace flag).
AlwaysShowComponentsList=If this directive is set to yes, Setup will always show the\ncomponents list for customizable setups. If this is set to no\nSetup will only show the components list if the user selected\na custom type from the type list.
AlwaysShowDirOnReadyPage=If this directive is set to yes, Setup will always show the\nselected directory in the list of settings on the Ready to\nInstall wizard page.\n\nIf this is set to no, Setup will not show the selected directory\nif DisableDirPage is yes.
AlwaysShowGroupOnReadyPage=If this directive is set to yes, Setup will always show the\nselected Start Menu folder name in the list of settings on the\nReady to Install wizard page.\n\nIf this is set to no, Setup will not show the selected Start\nMenu folder name if DisableProgramGroupPage is yes.\n\nIf no Start Menu folder is going to be created by Setup, this\ndirective is effectively ignored.
AlwaysUsePersonalGroup=Normally on Windows NT platforms, Inno Setup's {group} constant\npoints to the All Users start menu if the user has administrative\nprivileges. If this directive is set to yes, it always uses current\nuser's profile.
AppComments=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.
AppContact=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.
AppCopyright=Specifies a copyright message that Setup will display in the\nbottom-right corner of Setup's background window when WindowVisible\nis yes.\n\nThe value of this directive is also used as the default value\nfor the VersionInfoCopyright directive if it is not specified.
AppendDefaultDirName=By default, when a folder in the dialog displayed by the Browse...\nbutton on the Select Destination Location wizard page is clicked,\nSetup automatically appends the last component of DefaultDirName\nonto the new path.
AppendDefaultGroupName=By default, when a folder in the dialog displayed by the Browse...\nbutton on the Select Start Menu Folder wizard page is clicked,\nSetup automatically appends the last component of DefaultGroupName\nonto the new path.\n\nSetting this directive to no disables the aforementioned behavior.\nIn addition, it causes a Make New Folder button to appear on the\ndialog.
AppId=The value of AppId is stored inside uninstall log files (unins???.dat),\nand is checked by subsequent installations to determine whether it may\nappend to a particular existing uninstall log.\n\nSetup will only append to an uninstall log if the AppId of the existing\nuninstall log is the same as the current installation's AppId.\n\nFor a practical example, say you have two installations -- one entitled\nMy Program and the other entitled My Program 1.1 Update. To get My\nProgram 1.1 Update to append to My Program's uninstall log, you\nwould have to set AppId to the same value in both installations.
AppModifyPath=When this directive is set, a separate "Modify" button in the\nAdd/Remove Programs Control Panel applet in Windows 2000/XP/2003\nwill be displayed.\n\nSetting it is optional, and will have no effect on earlier Windows\nversions. The value may include constants.
AppMutex=This directive is used to prevent the user from installing new\nversions of an application while the application is still running,\nand to prevent the user from uninstalling a running application.\nIt specifies the names of one or more named mutexes (multiple\nmutexes are separated by commas), which Setup and Uninstall will\ncheck for at startup.\n\nIf any exist, Setup/Uninstall will display the message:\n"[Setup or Uninstall] has detected that [AppName] is currently\n running. Please close all instances of it now, then click OK\nto continue, or Cancel to exit."\n\nThe value may include constants.
AppName=This required directive specifies the title of the application\nyou are installing. Do not include the version number, as the\nAppVerName directive is for that purpose. AppName is shown\nthroughout the installation process, in places like the upper-left\ncorner of the Setup screen, and in the wizard. The value may\ninclude constants.\n\nThe value of this directive is also used as the default value\nfor the VersionInfoDescription directive if it is not specified.
AppPublisher=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.\n\nThe value of the AppPublisher directive is also used as the\ndefault value for the VersionInfoCompany directive if it is not\nspecified.
AppPublisherURL=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.
AppReadmeFile=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.
AppSupportPhone=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.
AppSupportURL=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.
AppUpdatesURL=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.
AppVerName=The value of this required directive should be the same (or\nsimilar to) the value of AppName, but it should also include\nthe program's version number. The value may include constants.
AppVersion=The values of these directives are displayed on the "Support"\ndialog of the Add/Remove Programs Control Panel applet in\nWindows 2000/XP/2003. Setting them is optional, and will have\nno effect on earlier Windows versions. The values may include\nconstants.\n\nIt is also used to set the MajorVersion and MinorVersion\nvalues in the Uninstall registry key when possible.
ArchitecturesAllowed=Specifies which processor architecture(s) Setup is allowed to\nrun on. If this directive is not specified or is blank, Setup\nwill be allowed to run on all processor architectures capable of\nexecuting its 32-bit code (including ones it doesn't recognize).\n\nOtherwise, if a user's processor architecture is not one of those\nspecified in this directive, Setup will display an error message\nand exit.
ArchitecturesInstallIn64BitMode=Specifies the 64-bit processor architecture(s) on which Setup\nshould install in 64-bit mode. If this directive is not specified\nor is blank, Setup will always install in 32-bit mode.\n\nNormally, you should not change this directive from its default\nvalue unless your application contains native 64-bit binaries.
BackColor=The BackColor directive specifies the color to use at the top\n(or left, if BackColorDirection=lefttoright) of the setup\nwindow's gradient background. BackColor2 specifies the color\nto use at the bottom (or right).\n\nThe setting of BackColor2 is ignored if BackSolid=yes.
BackColor2=The BackColor directive specifies the color to use at the top\n(or left, if BackColorDirection=lefttoright) of the setup\nwindow's gradient background. BackColor2 specifies the color\nto use at the bottom (or right).\n\nThe setting of BackColor2 is ignored if BackSolid=yes.
BackColorDirection=This determines the direction of the gradient background on the\nsetup window. If BackColorDirection is toptobottom, it is drawn\nfrom top to bottom; if it is lefttoright, it is drawn from left\nto right.
BackSolid=This specifies whether to use a solid or gradient background on\nthe setup window. If this is yes, the background is a solid color\n(the color specified by BackColor; BackColor2 is ignored).
ChangesAssociations=When set to yes, Setup will tell Explorer to refresh its file\nassociations information at the end of the installation, and\nUninstall will do the same at the end of uninstallation.\n\nIf your installation creates a file association but doesn't\nhave ChangesAssociations set to yes, the correct icon for the\nfile type likely won't be displayed until the user logs off or\nrestarts the computer.
ChangesEnvironment=When set to yes, at the end of the installation Setup will notify\nother running applications (notably Windows Explorer) that they\nshould reload their environment variables from the registry.\n\nOn Windows NT platforms, if your installation creates or changes\nan environment variable but doesn't have ChangesEnvironment\nset to yes, the new/changed environment variable will not be seen\nby applications launched from Explorer until the user logs off or\nrestarts the computer.
CompileLogFile=
CompileLogMethod=
Compression=This specifies the method of compression to use on the files,\nand optionally the level of compression. Higher levels compress\nbetter but take longer doing so, and may also require more memory\nwhile compressing/decompressing.
CompressionLevel=What level of compression to use
CompressionThreads=Controls whether multi-threading mode is enabled on the LZMA\ncompressor. Multi-threading can speed up the compression process\nby 50% or more on systems with multiple processor cores, and 20%\nor more on systems with single-core Intel processors featuring\nHyper-Threading Technology.
CreateAppDir=If this is set to no, no directory for the application will be\ncreated, the Select Destination Location wizard page will not\nbe displayed, and the {app} directory constant is equivalent to\nthe {win} directory constant.\n\nIf the uninstall feature is enabled when CreateAppDir is no, the\nuninstall data files are created in the system's Windows directory.
CreateUninstallRegKey=If this is set to no, Setup won't create an entry in the Add/Remove\nPrograms Control Panel applet. This can be useful if your installation\nis merely an update to an existing application and you don't want\nanother entry created, but don't want to the disable the uninstall\nfeatures entirely (via Uninstallable=no).\n\nWhen this directive is set to no, UpdateUninstallLogAppName is usually\nset to no as well.
DefaultDirName=The value of this required directive is used for the default\ndirectory name, which is used in the Select Destination Location\npage of the wizard. Normally it is prefixed by a directory constant.\n\nIf UsePreviousAppDir is yes (the default) and Setup finds a previous\nversion of the same application is already installed, it will\nsubstitute the default directory name with the directory selected\npreviously.
DefaultGroupName=The value of this directive is used for the default Start Menu\nfolder name on the Select Start Menu Folder page of the wizard.\nIf this directive is blank or isn't specified, it will use\n"(Default)" for the name.\n\nKeep in mind that Start Menu folders are stored as literal\ndirectories so any characters not allowed in normal directory\nnames can't be used in Start Menu folder names.
DefaultUserInfoName=Specifies the default name shown on the User Information wizard\npage. This can include constants.
DefaultUserInfoOrg=Specifies the default organization shown on the User Information\nwizard page. This can include constants.
DefaultUserInfoSerial=Specifies the default serial number shown on the User Information\nwizard page. This can include constants.
DirExistsWarning=When set to auto, the default setting, Setup will show a\n"The directory ... already exists. Would you like to install to\nthat directory anyway?" message if the user selects a directory\nthat already exists on the Select Destination Location wizard page,\nexcept when another version of the same application is already\ninstalled and the selected directory is the same as the previous one\n(only if UsePreviousAppDir is yes, the default setting).\n\nWhen set to yes, Setup will always display the "Directory Exists"\nmessage when the user selects an existing directory.\n\nWhen set to no, Setup will never display the "Directory Exists"\nmessage.
DisableDirPage=If this is set to yes, Setup will not show the Select Destination\nLocation wizard page. In this case, it will always use the default\ndirectory name.
DisableFinishedPage=If this is set to yes, Setup will not show the Setup Completed\nwizard page, and instead will immediately close the Setup program\nonce the installation process finishes. This may be useful if you\nexecute a program in the [Run] section using the nowait flag, and\ndon't want the Setup Completed window to remain in the background\nafter the other program has started.\n\nNote that the DisableFinishedPage directive is ignored if a restart\nof the computer is deemed necessary, or if a file is assigned to\nthe InfoAfterFile [Setup] section directive. In those cases, the\nSetup Completed wizard page will still be displayed.
DisableProgramGroupPage=If this is set to yes, Setup will not show the Select Start Menu\nFolder wizard page. In this case, it uses the folder name specified\nby the DefaultGroupName [Setup] section directive, or "(Default)"\nif none is specified.
DisableReadyMemo=If this is set to yes, Setup will not show a list of settings\non the Ready to Install wizard page. Otherwise the list is shown\nand contains information like the chosen setup type and the chosen\ncomponents.
DisableReadyPage=If this is set to yes, Setup will not show the Ready to Install\nwizard page.
DisableStartupPrompt=When this is set to yes, Setup will not show the This will install...\nDo you wish to continue? prompt.\n\nThis setting has no effect if UseSetupLdr is set to no.
DisableWelcomePage=If this is set to yes, Setup will not show the Welcome wizard page.
DiskClusterSize=This specifies the cluster size of the disk media.\n\nThe Setup Compiler needs to know this in order to properly\nfill each disk to capacity.\n\nThis directive is ignored if disk spanning is not\nenabled using the DiskSpanning [Setup] section directive.
DiskSliceSize=This specifies the maximum number of bytes per disk slice\n(SETUP-*.BIN file).\n\nNormally, this should be set to the total number of bytes\navailable on the disk media divided by the value of the\nSlicesPerDisk [Setup] section directive, which defaults to 1.\n\nThis directive is ignored if disk spanning is not enabled\nusing the DiskSpanning [Setup] section directive.\n\nAs of Inno Setup version 5.3.8, the default value has been\nchanged to 2100000000 whcih is the max value
DiskSpanning=If set to yes, the disk spanning feature will be enabled.\n\nInstead of storing all the compressed file data inside SETUP.EXE,\nthe compiler will split it into multiple SETUP-*.BIN files -- known as\n"slices" -- suitable for copying onto separate floppy disks,\nCD-ROMs, or DVD-ROMs.
EnableDirDoesntExistWarning=When set to yes, Setup will display a message box if the directory\nthe user selects doesn't exist. Usually you will also set\nDirExistsWarning=no when this is yes.
Encryption=If set to yes, files that are compiled into the installation\n(via [Files] section entries) will be encrypted using ARCFOUR\nencryption, with a 128-bit key derived from the value of the\nPassword [Setup] section directive.
ExtraDiskSpaceRequired=Normally, the disk space requirement displayed on the wizard is\ncalculated by adding up the size of all the files in the\n[Files] section. If you want to increase the disk space display\nfor whatever reason, set ExtraDiskSpaceRequired to the amount of\nbytes you wish to add to this figure. (1048576 bytes = 1 megabyte)
FlatComponentsList=When this directive is set to yes, Setup will use 'flat'\ncheckboxes for the components list. Otherwise Setup will use\n'3D' checkboxes.
InfoAfterFile=Specifies the name of an optional "readme" file, in .txt or .rtf\n(rich text) format, which is displayed after a successful install.\nThis file must be located in your installation's source directory\nwhen running the Setup Compiler, unless a fully qualified pathname\nis specified or the pathname is prefixed by "compiler:", in which\ncase it looks for the file in the Compiler directory.\n\nThis differs from isreadme files in that this text is displayed\nas a page of the wizard, instead of in a separate Notepad window.\n\nIf the user selects a language for which the InfoAfterFile\nparameter is set, this directive is effectively ignored. See the\n[Languages] section documentation for more information.
InfoBeforeFile=Specifies the name of an optional "readme" file, in .txt or .rtf\n(rich text) format, which is displayed before the user selects\nthe destination directory for the program. This file must be\nlocated in your installation's source directory when running\nthe Setup Compiler, unless a fully qualified pathname is specified\nor the pathname is prefixed by "compiler:", in which case it looks\nfor the file in the Compiler directory.\n\nIf the user selects a language for which the InfoBeforeFile\nparameter is set, this directive is effectively ignored. See the\n[Languages] section documentation for more information.  
InternalCompressLevel=This specifies the level of LZMA compression to use on Setup's\ninternal structures. Generally, there is little reason to change\nthis from the default setting of normal.
LanguageDetectionMethod=When set to uilanguage, Setup will determine the default language\nto use by checking the user's "UI language" (by calling\nGetUserDefaultUILanguage(), or on Windows versions where that\nfunction is unsupported, by reading the registry). This is the\nmethod that Microsoft recommends. The "UI language" is the language\nused in Windows own dialogs. Thus, on an English edition\nof Windows, English will be the default, while on a Dutch edition\nof Windows, Dutch will be the default. On the MUI edition of\nWindows, the default will be the currently selected UI language.\n\nWhen set to locale, Setup will determine the default language to\nuse by calling GetUserDefaultLangID(). This function returns the\nsetting of "Your locale" in Control Panel's Regional Options. It\nshould however be noted that since Windows 2000 the "Your locale"\noption is not intended to affect languages; it is only documented\nto affect "numbers, currencies, times, and dates".\n\nWhen set to none, Setup will use the first language specified in\nthe [Languages] section as the default language.
LicenseFile=Specifies the name of an optional license agreement file, in .txt\nor .rtf (rich text) format, which is displayed before the user\nselects the destination directory for the program. This file must\nbe located in your installation's source directory when running\nthe Setup Compiler, unless a fully qualified pathname is specified\nor the pathname is prefixed by "compiler:", in which case it looks\nfor the file in the Compiler directory.\n\nIf the user selects a language for which the LicenseFile parameter\nis set, this directive is effectively ignored. See the [Languages]\nsection documentation for more information.
LZMAAlgorithm=Controls the algorithm used by the LZMA and LZMA2 compressors.\n\nA value of 0 enables the fast algorithm.\nA value of 1 enables the normal algorithm
LZMABlockSize=Controls the block size used by the LZMA2 compressor, in\nkilobytes, when LZMANumBlockThreads is set to 2 or higher.\n\nNote that setting this too high can negate the benefits of\nusing multiple block threads. Typically, the block size should\nbe no more than the total size of your data divided by the\nnumber of block threads.
LZMADictionarySize=Controls the dictionary size used by the LZMA and LZMA2 compressors,\nin kilobytes. A larger dictionary size can provide a better\ncompression ratio at the expense of compression speed and memory\nrequirements.\n\nReview the memory requirements listed in the Compression topic\nbefore using.\n\nIf an "Out of memory" error is seen when a very large dictionary\nsize is used, LZMAUseSeparateProcess may need to be set.
LZMAMatchFinder=Controls the match finder method used by the LZMA and LZMA2\ncompressors.\n\nA value of HC enables the Hash Chain method with 4 hash bytes.\n\nA value of BT enables the Binary Tree method with 4 hash bytes.\n\nThe Binary Tree method can provide a better compression ratio\nat the expense of compression speed.
LZMANumBlockThreads=When compressing a large amount of data, the LZMA2 compressor\nhas the ability to divide the data into "blocks" and compress\ntwo or more of these blocks in parallel through the use of\nadditional threads (provided sufficient processor power is\navailable). This directive specifies the number of threads to\nuse -- that is, the maximum number of blocks that the LZMA2\ncompressor may compress in parallel.\n\nPLEASE REVIEW THE HELP DOCUMENTATION BEFORE MODIFYING
LZMANumFastBytes=Controls number of fast bytes used by the LZMA and LZMA2\ncompressors. A larger number of fast bytes can provide a better\ncompression ratio at the expense of compression speed.
LZMAUseSeparateProcess=Controls whether LZMA compression is performed inside the main\ncompiler process or in a separate process.\n\nUsing a separate process for LZMA compression allows the\ncompressor to allocate larger amounts of memory, which makes\nit possible for higher LZMADictionarySize and LZMANumBlockThreads\nsettings to be used. Additionally, on 64-bit Windows (x64), a\nsmall increase in compression speed may be observed.
MergeDuplicateFiles=Normally two file entries referring to the same source file\nwill be compressed and stored only once. If you have a bunch\nof identical files in your installation, make them point to the\nsame source file in the script, and the size of your installation\ncan drop significantly.\n\nIf you wish to disable this feature for some reason, set this\ndirective to no
MinVersion=This directive lets you specify a minimum version of Windows\nthat your software runs on
OnlyBelowVersion=This directive lets you specify a minimum version of Windows NT\nthat your software will not run on
OutputBaseFilename=This directive allows you to assign a different name for the\nresulting Setup file(s), so you don't have to manually rename\nthem after running the Setup Compiler.
OutputDir=Specifies the "output" directory for the script, which is where\nthe Setup Compiler will place the resulting SETUP.* files.\n\nBy default, it creates a directory named "Output" under the\ndirectory containing the script for this.
OutputManifestFile=When this directive is set, the compiler will create a manifest\nfile detailing information about the files compiled into Setup.\nThe file will be created in the output directory unless a path\nis included.
Password=Specifies a password you want to prompt the user for at the\nbeginning of the installation.\n\nWhen using a password, you might consider setting Encryption\nto yes as well, otherwise files will be stored as plain text\nand it would not be exceedingly difficult for someone to gain\naccess to them through reverse engineering.\n\nThe password itself is not stored as clear text; it's stored\nas a 128-bit MD5 hash, salted with a 64-bit random number.\n(Note: When encryption is enabled, this stored hash is not used\nfor the encryption key; a different hash with a different salt\nis generated for that.)
PrivilegesRequired=This directive specifies the minimum user privileges required\nto run the installation. When set to poweruser or admin,\nSetup will give an error message at startup (e.g. "You must be\nlogged in as an administrator when installing this program")\nif the user doesn't have at least Power User or administrative\nprivileges, respectively. This only applies to Windows NT platforms.
ReserveBytes=This specifies the minimum number of free bytes to reserve on\nthe first disk.\n\nThis is useful if you have to copy other files onto the first\ndisk that aren't part of the setup program, such as a Readme file.\n\nThe Setup Compiler rounds this number up to the nearest cluster.\n\nThis directive is ignored if disk spanning is not enabled using\nthe DiskSpanning [Setup] section directive.
RestartIfNeededByRun=When set to yes, and a program executed in the [Run] section\nqueues files to be replaced on the next reboot (by calling\nMoveFileEx or by modifying wininit.ini), Setup will detect this\nand prompt the user to restart the computer at the end of\ninstallation.
SetupIconFile=Specifies a custom program icon to use for Setup/Uninstall. The\nfile must be located in your installation's source directory\nwhen running the Setup Compiler, unless a fully qualified pathname\nis specified or the pathname is prefixed by "compiler:", in which\ncase it looks for the file in the Compiler directory.\n\nThis directive is not supported if you're compiling under Windows\n95/98/Me.
SetupLogging=If set to true, Setup will always create a log file. Equivalent\nto passing /LOG on the command line
ShowComponentSizes=When this directive is set to yes, Setup will show the size of\na component in the components list. Depending on the largest\ncomponent, Setup will display sizes in kilobytes or in megabytes.
ShowLanguageDialog=When set to yes and there are multiple [Languages] section entries,\na Select Language dialog will be displayed to give the\nuser an opportunity to override the language Setup chose by default.\nSee the [Languages] section documentation for more information.\n\nWhen set to no, the dialog will never be displayed.\n\nWhen set to auto, the dialog will only be displayed if Setup does\nnot find a language identifier match.
ShowTasksTreeLines=When this directive is set to yes, Setup will show 'tree lines'\nbetween parent and sub tasks.
ShowUndisplayableLanguages=By default, languages that cannot be displayed on a user's system\ndue to a code page mismatch are not listed in the Select Language\ndialog. For example, Russian text can only be displayed properly\nif the active code page is 1251; if the user isn't running code\npage 1251 they will not see Russian as an option.\n\nIf this directive is set to yes, all languages will be listed in\nthe Select Language dialog. To avoid user confusion, it is not\nrecommended that you enable this in production installs.
SignedUninstaller=Specifies whether the uninstaller program (unins???.exe) should\nbe deployed with a digital signature attached. When the uninstaller\nhas a valid digital signature, Windows Vista users will not see an\n"unidentified program" warning when launching it from outside of\nControl Panel.
SignedUninstallerDir=Specifies the directory in which signed uninstaller files should\nbe stored. By default, such files are stored in the output directory.\nSeparate script files may share the same SignedUninstallerDir setting.\n\nBy setting up a common directory to hold signed uninstaller files,\nyou won't have to re-sign the uninstaller each time you compile a\nnew script file with a distinct OutputDir setting. If\nSignedUninstallerDir is not a fully-qualified pathname, it will be\ntreated as being relative to SourceDir.\n\nSetting SignedUninstallerDir to . will result in the files being\nplaced in the source directory.
SignTool=Specifies the name and parameters of the Sign Tool to be used\nto digitally sign Setup (and Uninstall if SignedUninstaller is\nset to yes). When Setup has a valid digital signature, users will\nnot see an "unidentified program" warning when launching it.\n\nThe specified Sign Tool name and its command have to be defined\nin the compiler IDE (via the Tools | Configure Sign Tools... menu)
SlicesPerDisk=The number of SETUP-*.BIN files to create for each disk.\n\nIf this is 1 (the default setting), the files will be named\nSETUP-x.BIN, where x is the disk number.\n\nIf this is greater than 1, the files will be named SETUP-xy.BIN,\nwhere x is the disk number and y is a unique letter.
SolidCompression=If yes, solid compression will be enabled.\n\nThis causes all files to be compressed at once instead of\nseparately. This can result a much greater overall compression\nratio if your installation contains many files with common\ncontent, such as text files, especially if such common content\nfiles are grouped together within the [Files] section.\n\nThus, it is not recommended that solid compression be enabled\non huge installs (say, over 100 MB) or on disk-spanned installs.\nIt is primarily designed to save download time on smaller\ninstalls distributed over the Internet.
SourceDir=Specifies a new source directory for the script.
TerminalServicesAware=Specifies whether the compiler should set the "Terminal Services\naware" flag in the headers of the Setup and Uninstall programs.\nThis feature is new to version 5.1.7 and defaults to yes;\nprevious versions never set the flag.\n\nMost importantly, the "Terminal Services aware" flag affects the\nbehavior of the {win} constant (and GetWinDir support function)\non servers with Terminal Services installed in application mode.
TimeStampRounding=By default, time stamps on files referenced by [Files] section\nentries are rounded down to the nearest 2-second boundary.\nFAT partitions have only a 2-second time stamp resolution, so\nthis ensures that time stamps are set the same way on both FAT\nand NTFS partitions.\n\nThe rounding can be altered or disabled by setting the\nTimeStampRounding directive. Setting it to 0 will disable the\nrounding. Setting it to a number between 1 and 60 will cause\ntime stamps to be rounded down to the nearest\nTimeStampRounding-second boundary.
TimeStampsInUTC=By default, time stamps on files referenced by [Files] section\nentries are saved and restored as local times. This means that\nif a particular file has a time stamp of 01:00 local time at\ncompile time, Setup will extract the file with a time stamp of\n01:00 local time, regardless of the user's time zone setting\nor whether DST is in effect.\n\nIf TimeStampsInUTC is set to yes, time stamps will be saved and\nrestored in UTC -- the native time format of Win32 and NTFS. \nIn this mode, a file with a time stamp of 01:00 local time in\nNew York will have a time stamp of 06:00 local time when\ninstalled in London.
TouchDate=The date used in the time/date stamp of files referenced by\n[Files] section entries that include the touch flag.\n\nA value of current causes the current system date (at compile\ntime) to be used. A value of none leaves the date as-is.\nOtherwise, TouchDate is interpreted as an explicit date in\nYYYY-MM-DD (ISO 8601) format. If TimeStampsInUTC is set to yes,\nthe date is assumed to be a UTC date.
TouchTime=The time used in the time/date stamp of files referenced by\n[Files] section entries that include the touch flag.\n\nA value of current causes the current system time (at compile\ntime) to be used. A value of none leaves the time as-is.\nOtherwise, TouchTime is interpreted as an explicit time in\nHH:MM or HH:MM:SS format. If TimeStampsInUTC is set to yes, the\ntime is assumed to be a UTC time.
Uninstallable=This determines if Inno Setup's automatic uninstaller is to be\nincluded in the installation.\n\nIf this is yes or to a boolean expression evaluating to True the\nuninstaller is included.Otherwise, no uninstallation support is\nincluded, requiring the end-user to manually remove the files\npertaining to your application.\n\nSetting this to a boolean expression can be useful if you want\nto offer the user a 'portable mode' option.
UninstallDisplayIcon=This lets you specify a particular icon file (either an executable\nor an .ico file) to display for the Uninstall entry in the\nAdd/Remove Programs Control Panel applet on Windows 2000/XP/2003.\nThe filename will normally begin with a directory constant.
UninstallDisplayIconIndex=If the file you specify contains multiple icons, you may append\nthe suffix ",n" to specify an icon index, where n is the zero-based\nnumeric index.\n\nIf this directive is not specified or is blank, Windows will select\nan icon itself, which may not be the one you prefer.
UninstallDisplayName=This lets you specify a custom name for the program's entry in\nthe Add/Remove Programs Control Panel applet. The value may\ninclude constants. If this directive is not specified or is blank,\nSetup will use the value of [Setup] section directive AppVerName\nfor the name.\n\nDue to limitations of Windows 95/98/Me's Add/Remove Programs\nControl Panel applet, the value of UninstallDisplayName will be\ntrimmed if it exceeds 63 characters.
UninstallDisplaySize=On Windows 7 and newer, Setup uses this directive to set the\nEstimatedSize value in the Uninstall registry key when possible\nsince the Windows 7 Add/Remove Programs Control Panel (called\nProgram and Features) no longer automatically calculates it.\n\nIf an UninstallDisplaySize is not set, Setup estimates the size\nitself by taking the size of all files installed and adding any\nExtraDiskSpaceRequired values set. Note: Windows 7 only supports\nthe display of values smaller than 4 GB.\n\nSet in bytes. (1048576 bytes = 1 megabyte)
UninstallFilesDir=Specifies the directory where the "unins*.*" files for the\nuninstaller are stored.\n\nNote: You should not assign a different value here on a new\nversion of an application, or else Setup won't find the\nuninstall logs from the previous versions and therefore won't\nbe able to append to them.
UninstallLogMode=append, the default setting, instructs Setup to append to an\nexisting uninstall log when possible.\n\nnew, which corresponds to the behavior in pre-1.3 versions of\nInno Setup, instructs Setup to always create a new uninstall log.\n\noverwrite instructs Setup to overwrite any existing uninstall\nlogs from the same application instead of appending to them (this\nis not recommended). The same rules for appending to existing logs\napply to overwriting existing logs.
UninstallRestartComputer=When set to yes, the uninstaller will always prompt the user to\nrestart the system at the end of a successful uninstallation,\nregardless of whether it is necessary (e.g., because of [Files]\nsection entries with the uninsrestartdelete flag).
UpdateUninstallLogAppName=If yes, when appending to an existing uninstall log, Setup will\nreplace the AppName field in the log with the current installation's\nAppName. The AppName field of the uninstall log determines the title\ndisplayed in the uninstaller. You may want to set this to no if your\ninstallation is merely an upgrade or add-on to an existing program,\nand you don't want the title of the uninstaller changed.
UsePreviousAppDir=When this directive is yes, the default, at startup Setup will\nlook in the registry to see if the same application is already\ninstalled, and if so, it will use the directory of the previous\ninstallation as the default directory presented to the user in\nthe wizard.\n\nNote that Setup cannot re-use settings from a previous installation\nthat had Uninstallable set to no, since the registry entries it\nlooks for are not created when Uninstallable is no.
UsePreviousGroup=When this directive is yes, the default, at startup Setup will\nlook in the registry to see if the same application is already\ninstalled, and if so, it will use the Start Menu folder name of\nthe previous installation as the default Start Menu folder name\npresented to the user in the wizard. Additionally, if AllowNoIcons\nis set to yes, the Don't create any icons setting from the previous\ninstallation will be restored. \n\nNote that Setup cannot re-use settings from a previous installation\nthat had Uninstallable set to no, since the registry entries it\nlooks for are not created when Uninstallable is no.
UsePreviousLanguage=When this directive is yes, the default, at startup Setup will\nlook in the registry to see if the same application is already\ninstalled, and if so, it will use the language of the previous\ninstallation as the default language selected in the list of\navailable languages on the Select Language dialog.\n\nNote that this directive does not change the language used by\nthe Select Language dialog itself because it cannot assume that\nthe current user understands the same languages as the previous\nuser. See the [Languages] section help topic for details on which\nlanguage the Select Language dialog uses by default.\n\nAlso note that Setup cannot re-use settings from a previous\ninstallation that had Uninstallable set to no, since the registry\nentries it looks for are not created when Uninstallable is no.\n\nUsePreviousLanguage must be set to no when AppId includes constants.
UsePreviousSetupType=When this directive is yes, the default, at startup Setup will\nlook in the registry to see if the same application is already\ninstalled, and if so, it will use the setup type and component\nsettings of the previous installation as the default settings\npresented to the user in the wizard.\n\nNote that Setup cannot re-use settings from a previous installation\nthat had Uninstallable set to no, since the registry entries it\nlooks for are not created when Uninstallable is no.
UsePreviousTasks=When this directive is yes, the default, at startup Setup will\nlook in the registry to see if the same application is already\ninstalled, and if so, it will use the task settings of the\nprevious installation as the default settings presented to the\nuser in the wizard.\n\nNote that Setup cannot re-use settings from a previous installation\nthat had Uninstallable set to no, since the registry entries it\nlooks for are not created when Uninstallable is no.
UsePreviousUserInfo=When this directive is yes, the default, at startup Setup will\nlook in the registry to see if the same application is already\ninstalled, and if so, it will use the name, organization and\nserial number entered previously as the default settings presented\nto the user on the User Information wizard page.\n\nNote that Setup cannot re-use settings from a previous installation\nthat had Uninstallable set to no, since the registry entries it\nlooks for are not created when Uninstallable is no.
UserInfoPage=If this is set to yes, Setup will show a User Information wizard\npage which asks for the user's name, organization and possibly\na serial number. The values the user enters are stored in the\n{userinfoname}, {userinfoorg} and {userinfoserial} constants.\nYou can use these constants in [Registry] or [INI] entries to\nsave their values for later use.
UseSetupLdr=This tells the Setup Compiler which type of Setup to create.\nIf this is yes, it compiles all setup data into a single EXE.\nIf this is no, it compiles the setup data into at least three\nfiles: setup.exe, setup-0.bin, and setup-1.bin. The only reason\nyou would probably want to use no is for debugging purposes.\n\nNOTE: Do not use UseSetupLdr=no on an installation which uses\ndisk spanning (DiskSpanning=yes).
VersionInfoCompany=Specifies the company name value for the Setup version info.
VersionInfoCopyright=Specifies the copyright value for the Setup version info.
VersionInfoDescription=Specifies the file description value for the Setup version info.
VersionInfoProductName=Specifies the product name value for the Setup version info.
VersionInfoProductTextVersion=Specifies the textual product version value for the Setup version info.
VersionInfoProductVersion=Specifies the binary file version value for the Setup version\ninfo. Partial version numbers are allowed. Missing numbers will\nbe appended as zero's.\n\nNote that this value is only known to be displayed by Explorer\non Windows Vista SP2. Other versions display the textual product\nversion value (VersionInfoProductTextVersion) instead.
VersionInfoTextVersion=Specifies the textual file version value for the Setup version info.\n\nNOTE that this value is only displayed on Explorer's Version tab\non Windows 98 and earlier. Later versions display the binary\nversion numbers (VersionInfoVersion) instead.
VersionInfoVersion=Specifies the binary file version value for the Setup version\ninfo. Partial version numbers are allowed. Missing numbers will\nbe appended as zero's.
WindowResizable=If set to no, the user won't be able to resize the Setup\nprogram's background window when it's not maximized.\n\nThis directive has no effect if WindowVisible is not set to yes.
WindowShowCaption=If set to no, Setup will be truly "full screen" -- it won't\nhave a caption bar or border, and it will be on top of the\ntaskbar.\n\nThis directive has no effect if WindowVisible is not set to yes.
WindowStartMaximized=If set to yes, the Setup program's background window will\ninitially be displayed in a maximized state, where it won't\ncover over the taskbar.\n\nThis directive has no effect if WindowVisible is not set to yes.
WindowVisible=If set to yes, there will be a gradient background window displayed\nbehind the wizard.\n\nNote that this is considered a legacy feature; it likely will be\nremoved at some point in the future.
WizardImageBackColor=A value in the form of $bbggrr, where rr, gg, and bb specify\nthe two-digit intensities (in hexadecimal) for red, green, and\nblue respectively. Or it may be one of the following predefined\ncolor names: clBlack, clMaroon, clGreen, clOlive, clNavy,\nclPurple, clTeal, clGray, clSilver, clRed, clLime, clYellow,\nclBlue, clFuchsia, clAqua, clWhite.
WizardImageFile=Specifies the name of the bitmap file to display on the left\nside of the wizard in the Setup program. This file must be\nlocated in your installation's source directory when running\nthe Setup Compiler, unless a fully qualified pathname is\nspecified or the pathname is prefixed by "compiler:", in which\ncase it looks for the file in the Compiler directory.
WizardImageStretch=If set to yes, the default, the wizard images will be stretched\nor shrunk if the wizard is larger or smaller than normal, e.g.\nif the user is running in Large Fonts.\n\nIf set to no, the wizard images will be centered in their respective\nareas if the wizard is larger than normal, and clipped if the wizard\nis smaller than normal. (This corresponds to the default behavior\nof Inno Setup 4.1.2 and earlier.)
WizardSmallImageFile=Specifies the name of the bitmap file to display in the upper\nright corner of the wizard window. This file must be located\nin your installation's source directory when running the Setup\nCompiler, unless a fully qualified pathname is specified or the\npathname is prefixed by "compiler:", in which case it looks for\nthe file in the Compiler directory.
